In [2]:
import pandas as pd
import numpy as np

In [3]:
list=[10,56,87,90,34,23,12,58]
d=pd.Series(list)
print(d)

0    10
1    56
2    87
3    90
4    34
5    23
6    12
7    58
dtype: int64

In [4]:
dict={"physics":95,
     "chemistry":96,
     "math":91}
d=pd.Series(dict)
print(d)
d["physics"]

physics      95
chemistry    96
math         91
dtype: int64

95

In [5]:
e={"USA":1,"Germany":1,"Japan":4}
print(e["Japan"])

4

In [8]:
from numpy.random import(randn)
x=np.random.seed(202)
print(x)

None

In [12]:
df=pd.DataFrame(randn(5,4),index="A B C D E".split(),columns='W X Y Z'.split())
print(df)

          W         X         Y         Z
A -0.892795 -1.264323  0.640429 -0.380060
B -0.246679 -0.118568 -0.541902 -0.903899
C -0.205618  0.289614 -0.111383 -1.222770
D  0.287026  0.438055  0.603653  0.627203
E  2.061791 -1.072247 -0.289376  1.120785

In [15]:
df.drop('W',axis=1)

          X         Y         Z
A -1.264323  0.640429 -0.380060
B -0.118568 -0.541902 -0.903899
C  0.289614 -0.111383 -1.222770
D  0.438055  0.603653  0.627203
E -1.072247 -0.289376  1.120785

In [16]:
df['new']=df['W']+df['X']
print(df)

          W         X         Y         Z       new
A -0.892795 -1.264323  0.640429 -0.380060 -2.157118
B -0.246679 -0.118568 -0.541902 -0.903899 -0.365247
C -0.205618  0.289614 -0.111383 -1.222770  0.083996
D  0.287026  0.438055  0.603653  0.627203  0.725081
E  2.061791 -1.072247 -0.289376  1.120785  0.989544

In [20]:
df.iloc[3]

W      0.287026
X      0.438055
Y      0.603653
Z      0.627203
new    0.725081
Name: D, dtype: float64

In [21]:
df[df['W']>0]

          W         X         Y         Z       new
D  0.287026  0.438055  0.603653  0.627203  0.725081
E  2.061791 -1.072247 -0.289376  1.120785  0.989544

In [23]:
df[df['W']>0]['Y']

D    0.603653
E   -0.289376
Name: Y, dtype: float64

In [25]:
df[df['W']>0 & (df['Y']<1)]

          W         X         Y         Z       new
D  0.287026  0.438055  0.603653  0.627203  0.725081
E  2.061791 -1.072247 -0.289376  1.120785  0.989544

In [26]:
newind='CA CW WY OR TO'.split()
newind

['CA', 'CW', 'WY', 'OR', 'TO']

In [27]:
df["States"]=newind
df

          W         X         Y         Z       new States
A -0.892795 -1.264323  0.640429 -0.380060 -2.157118     CA
B -0.246679 -0.118568 -0.541902 -0.903899 -0.365247     CW
C -0.205618  0.289614 -0.111383 -1.222770  0.083996     WY
D  0.287026  0.438055  0.603653  0.627203  0.725081     OR
E  2.061791 -1.072247 -0.289376  1.120785  0.989544     TO

In [32]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}
f=pd.DataFrame(d)
f.head()

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20

In [1]:
import pandas as pd
outside=['61','62','63','45','87','88']
inside=[1,2,3,1,2,3]
hier_index =list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('61', 1),
            ('62', 2),
            ('63', 3),
            ('45', 1),
            ('87', 2),
            ('88', 3)],
           )

In [35]:
import numpy as np
df=pd.DataFrame({"a":pd.Series([1,2,np.nan,6]),
               "b":pd.Series([4,6,7,np.nan]),
               "c":pd.Series([3,np.nan,5,np.nan])})
df

     a    b    c
0  1.0  4.0  3.0
1  2.0  6.0  NaN
2  NaN  7.0  5.0
3  6.0  NaN  NaN

In [ ]:
df.dropna()

In [ ]:
df.fillna(0)

In [ ]:
import pandas as pd
d = {'Company':pd.Series(['Google','Google','MSFT','MSFT','FB','FB']),
   'Person':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith']),
   'Sales':pd.Series([10000,12000,11000,34000,78000,76000])}
d

In [ ]:
import pandas as pd
d = {'Company':(['Google','Google','MSFT','MSFT','FB','FB']),
   'Person':(['Tom','James','Ricky','Vin','Steve','Smith']),
   'Sales':([10000,12000,11000,34000,78000,76000])}
e=pd.DataFrame(d)
e

In [ ]:
import pandas as pd  
x = pd.Series([1,2,3],index = ['a','b','c'])  
#retrieve the first element  
print (x['b'])
print(x[])

In [ ]:
import pandas as pd

In [11]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                index=[0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [13]:
df2=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                index=[4,5,6,7])
df2

    A   B   C   D
4  A0  B0  C0  D0
5  A1  B1  C1  D1
6  A2  B2  C2  D2
7  A3  B3  C3  D3

In [14]:
df3=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                index=[8,9,10,11])
df3

     A   B   C   D
8   A0  B0  C0  D0
9   A1  B1  C1  D1
10  A2  B2  C2  D2
11  A3  B3  C3  D3

In [15]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A0   B0   C0   D0  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A1   B1   C1   D1  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A2   B2   C2   D2  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A3   B3   C3   D3  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A0   B0   C0   D0
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A1   B1   C1   D1
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A2   B2   C2   D2
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A3   B3   C3   D3

In [ ]:
pd.concat([df1,df2,df3],axis=0)

In [ ]:
left=pd.DataFrame({'key1':['K0','K0','K1','K2'],
                 'key2':['k0','K1','K0','K1'],
                 'A':['C0','C1','C2','C3'],
                 'B':['D0','D1','D2','D3']},
                index=[8,9,10,11])
right=pd.DataFrame({'key1':['K0','K1','K1','K2'],
                 'key2':['K0','K0','K0','K0'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                index=[12,13,14,15])

pd.merge(left,right,on=['key1','key2'])

In [ ]:
pd.merge(left,right,how='right',on=['key1','key2'])

In [ ]:
pd.merge(left,right,how='left',on=['key1','key2'])

In [ ]:
# joining
left=pd.DataFrame({'key1':['K0','K0','K1','K2'],
                 'key2':['k0','K1','K0','K1'],
                 'A':['C0','C1','C2','C3'],
                 'B':['D0','D1','D2','D3']},
                index=[8,9,10,11])
right=pd.DataFrame({'key3':['K0','K1','K1','K2'],
                 'key4':['K0','K0','K0','K0'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']},
                index=[8,9,10,11])
left.join(right)

In [ ]:
right.columns

In [ ]:
left.columns

In [ ]:
right.sum(axis=0)

In [ ]:
right.sum(axis=1)

In [ ]:
def fun(x):
    return x*2

In [ ]:
left=pd.DataFrame({'key1':['K0','K0','K1','K2'],
                 'key2':['k0','K1','K0','K1'],
                 'A':['C0','C1','C2','C3'],
                 'B':[1,2,3,4]})
right=pd.DataFrame({'key3':['K0','K1','K1','K2'],
                 'key4':['K0','K0','K0','K0'],
                 'C':['C0','C1','C2','C3'],
                 'D':[1,2,3,4]})
right['B'].apply(fun)

In [ ]:
import numpy as np
df=pd.DataFrame({'A':[1,2,np.nan,3],
               'B':[2,np.nan,3,4],
               'C':[3,6,np.nan,np.nan]})
df

In [ ]:
df.dropna()

In [ ]:
df.fillna(1)

In [ ]:
data=({'A':['foo','foo','bar',bar],})

### Data import and export

In [ ]:
df=pd.read_csv('Excel_Sample.csv')
df

In [ ]:
conda install lxml

In [ ]:
conda install htmlSlib

In [ ]:
conda install BeautifulSoup4